cask_args appdir: '/Applications', fontdir: '/Library/Fonts'

tap 'homebrew/bundle'
tap 'thoughtbot/formulae'
tap 'homebrew/dupes'


brew 'mas'
brew 'vim', args: ['override-system-vi']
brew 'git'
brew 'tmux'
brew 'imagemagick'
brew 'reattach-to-user-namespace'
brew 'wget', args: ['--with-iri']
brew 'ack'
brew 'rename'
brew 'tree'


# Cask
#brew 'caskroom/cask/brew-cask'
# Might be outdated

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Storage
#brew 'postgres'
#brew 'redis'


# More recent versions of system utils
brew 'coreutils'
brew 'homebrew/dupes/openssh', args: ['with-keychain-support']
brew 'homebrew/dupes/grep'



# QuickLook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'webpquicklook'

# Fonts
cask 'caskroom/fonts/font-inconsolata'
cask 'caskroom/fonts/font-inconsolata-lgc'
cask 'caskroom/fonts/font-inconsolata-for-powerline'
cask 'caskroom/fonts/font-inconsolata-g-for-powerline'
cask 'caskroom/fonts/font-liberation-mono-for-powerline'
#cask 'caskroom/fonts/font-meslo-lg-for-powerline' # Failed!
#cask 'caskroom/fonts/font-sauce-code-powerline' # Failed!
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-fira-mono-for-powerline'


cask 'adobe-photoshop-lightroom'
mas '1password', id: 443987910
cask 'dash'
cask 'dropbox'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'iterm2'
mas 'slack', id: 803453959
mas 'boxy',  id: 1053031090
cask 'spectacle'
cask 'sublime-text'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'

